food1 = input("음식이름을 입력하시오:")
food2 = input("음식이름을 입력하시오:")
food3 = input("음식이름을 입력하시오:")
food4 = input("음식이름을 입력하시오:")
food5 = input("음식이름을 입력하시오:")
food6 = input("음식이름을 입력하시오:")


밥 = [ 곤드레밥, 김치볶음밥, 주먹밥, 현미밥, 콩나물밥, 찰흑미밥, 볶음밥, 
면 = [ 어묵국, 된장국, 미역국, 계란국, 양송이스프,
국 =
반찬 =
후식 =


if food1 == 밥[0]:
    print("탄수화물= 3.3g, 단백질= 3.47g, 지질= 1.3g")
if food1 == 밥[1]:
    print("탄수화물= 24g, 단백질= 4.62g, 지질= 4.06g")
if food1 == 밥[2]:
    print("탄수화물= 34.75g, 단백질= 4.75g, 지질= 2.2g")
if food1 == 밥[3]:
    print("탄수화물= 34.3g, 단백질= 4.1g, 지질= 1g")
if food1 == 밥[4]:
    print("탄수화물= 22.4g, 단백질= 4.7g, 지질= 1.6g")
if food1 == 밥[5]:
    print("탄수화물= 33.76g, 단백질=2.8g, 지질=0.38g")
if food1 == 밥[6]:
    print("탄수화물= 28.2g, 단백질= 4.5g, 지질= 4.9g")
if food1 == 밥[7]:
    print("탄수화물= , 단백질=, 지질=")
if food1 == 밥[8]:
    print("탄수화물= , 단백질=, 지질=")
if food1 == 밥[9]:
    print("탄수화물= , 단백질=, 지질=")
if food1 == 밥[10]:
    print("탄수화물= , 단백질=, 지질=")
if food1 == 밥[12]:
    print("탄수화물= , 단백질=, 지질=")



if food1 == 국[0]:
    print("탄수화물= 5.7g, 단백질= 3.05g, 지질= 0.75g")
if food1 == 국[1]:
    print("탄수화물= 1.9g, 단백질= 1.9g, 지질= 1.2g")
if food1 == 국[2]:
    print("탄수화물= 63.2g, 단백질= 9.4g, 지질= 3.6g")
if food1 == 국[3]:
    print("탄수화물= 0.6g, 단백질= 2g, 지질= 1.6g")
if food1 == 국[4]:
    print("탄수화물= 3.33g, 단백질= 0.66g, 지질= 2.59g")


if food1 == 반찬[0]:
    print("탄수화물= 24.9g, 단백질= 8.9g, 지질= 0.7g")
if food1 == 반찬[1]:
    print("탄수화물= 5.4g, 단백질= 7.6g, 지질= 6.9g")
if food1 == 반찬[2]:
    print("탄수화물= 4.4g, 단백질= 1.4g, 지질= 0.2g")
if food1 == 반찬[3]:
    print("탄수화물= 5g, 단백질= 2g, 지질= 0.3g")
if food1 == 반찬[4]:
    print("탄수화물= 7.2g, 단백질= 12.1g, 지질= 10.75g")
if food1 == 반찬[5]:
    print("탄수화물= 7.54g, 단백질= 1.43g, 지질= 0.19g")
if food1 == 반찬[6]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 반찬[7]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 반찬[8]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 반찬[9]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 반찬[10]:
    print("탄수화물= g, 단백질= g, 지질= g")


if food1 == 후식[0]:
    print("탄수화물= 24.9g, 단백질= 8.9g, 지질= 0.7g")
if food1 == 후식[1]:
    print("탄수화물= 5.4g, 단백질= 7.6g, 지질= 6.9g")
if food1 == 후식[2]:
    print("탄수화물= 4.4g, 단백질= 1.4g, 지질= 0.2g")
if food1 == 후식[3]:
    print("탄수화물= 5g, 단백질= 2g, 지질= 0.3g")
if food1 == 후식[4]:
    print("탄수화물= 7.2g, 단백질= 12.1g, 지질= 10.75g")
if food1 == 후식[5]:
    print("탄수화물= 7.54g, 단백질= 1.43g, 지질= 0.19g")
if food1 == 후식[6]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 후식[7]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 후식[8]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 후식[9]:
    print("탄수화물= g, 단백질= g, 지질= g")
if food1 == 후식[10]:
    print("탄수화물= g, 단백질= g, 지질= g")
