food1 = input("음식이름을 입력하시오:")
food2 = input("음식이름을 입력하시오:")
food3 = input("음식이름을 입력하시오:")
food4 = input("음식이름을 입력하시오:")
food5 = input("음식이름을 입력하시오:")
food6 = input("음식이름을 입력하시오:")


밥 = [ 곤드레밥, 김치볶음밥, 주먹밥, 현미밥, 콩나물밥, 찰흑미밥, 볶음밥,보리밥,치밥,날치알김치덮밥,차수수밥,스팸마요덮밥,추억의도시락,오므라이스,피자떡볶이] 
국 = [ 어묵국, 된장국, 미역국, 계란국, 양송이스프,매운콤북어국,햄모둠찌개,유부된장국,육개장,얼갈이배추된장국,몽글이짬뽕순두부,쇠고기영양탕,열무된장국,어묵국,팽이버섯된장국콩나물맑은국]
면 =[쌀국수,로제스파게티]
반찬 =[치즈돈까스,두부양념구이,배추김치,오이무침,함박스테이크,깍두기,시금치초고추장무침,진미채고추장볶음,닭다리구이,오아자무침,감자채볶음,삼겹살고추장볶음,열무김치,치커리초고추장무침,
     닭꼬치데리야끼구이,우엉채조림,수육,무말랭이무침,오이피클, 건파래볶음, 도토리묵양념간장무침, 소불고기납작당면, 취나물볶음, 닭날개구이, 브로컬리, 새우튀김, 어묵야채고추장볶음,
     명엽채볶음, 연어버터구이,참나물무침, 닭꼬치까스, 돼지갈비매운찜, 미역줄기볶음, 메추리알소시지조림, 쪽파무침, 가자미양념구이, 진미채도라지볶음, 소떡소떡고추장구이, 오이양파무침,
     닭갈비볶음, 우동카레볶음, 멸치볶음, 김치볶음, 치킨텐더, 부추무침, 닭다리튀김]
후식 =[에그타르트, 요구르트, 주스, 대추방울토마토, 아이스슈, 푸딩, 초코우유, 과일, 구슬아이스크림, 라떼, 마늘바게트, 오미자주스, 회오리감자, 초코칩쿠키, 레몬에이드, 워터젤리]


if food1 == 밥[0]:
    print("탄수화물= 3.3g, 단백질= 3.47g, 지질= 1.3g")
if food1 == 밥[1]:
    print("탄수화물= 24g, 단백질= 4.62g, 지질= 4.06g")
if food1 == 밥[2]:
    print("탄수화물= 34.75g, 단백질= 4.75g, 지질= 2.2g")
if food1 == 밥[3]:
    print("탄수화물= 34.3g, 단백질= 4.1g, 지질= 1g")
if food1 == 밥[4]:
    print("탄수화물= 22.4g, 단백질= 4.7g, 지질= 1.6g")
if food1 == 밥[5]:
    print("탄수화물= 33.76g, 단백질=2.8g, 지질=0.38g")
if food1 == 밥[6]:
    print("탄수화물= 28.2g, 단백질= 4.5g, 지질= 4.9g")
if food1 == 밥[7]:
    print("탄수화물=68.5g , 단백질=18.5g, 지질=1.3g")
if food1 == 밥[8]:
    print("탄수화물=27g , 단백질=6.8g, 지질=1.9g")
if food1 == 밥[9]:
    print("탄수화물=27g , 단백질=3.8g, 지질=0.4g")
if food1 == 밥[10]:
    print("탄수화물=28g , 단백질=4.2g, 지질=8.5g")
if food1 == 밥[12]:
    print("탄수화물=33.76g , 단백질=2.83g, 지질=0.38g")
if food1 == 밥[13]:
    print("탄수화물=26g , 단백질=4g, 지질=1.5g")
if food1 == 밥[13]:
    print("탄수화물=25g , 단백질=4.8g, 지질=4.8g")
if food1 == 밥[14]:
    print("탄수화물=37g , 단백질=4.3g, 지질=2.3g")



if food1 == 국[0]:
    print("탄수화물= 5.7g, 단백질= 3.05g, 지질= 0.75g")
if food1 == 국[1]:
    print("탄수화물= 1.9g, 단백질= 1.9g, 지질= 1.2g")
if food1 == 국[2]:
    print("탄수화물= 63.2g, 단백질= 9.4g, 지질= 3.6g")
if food1 == 국[3]:
    print("탄수화물= 0.6g, 단백질= 2g, 지질= 1.6g")
if food1 == 국[4]:
    print("탄수화물= 3.33g, 단백질= 0.66g, 지질= 2.59g")
if food1 == 국[5]:
    print("탄수화물=3g , 단백질=2g, 지질=0g")
if food1 == 국[6]:
    print("탄수화물=10.3g , 단백질=5.8g, 지질=6.5g")
if food1 == 국[7]:
    print("탄수화물=2.3g , 단백질=3.44g, 지질=3.54g")
if food1 == 국[8]:
    print("탄수화물=1.6g , 단백질=4.02g, 지질=1.1g")
if food1 == 국[9]:
    print("탄수화물=2.57g , 단백질=1.45g, 지질=0.4g")
if food1 == 국[10]:
    print("탄수화물=1.9g , 단백질=3.6g, 지질=3.1g")
if food1 == 국[11]:
    print("탄수화물=1.85g , 단백질=3.623g, 지질=1g")
if food1 == 국[12]:
    print("탄수화물= 11g, 단백질= 8g, 지질= 2g")
if food1 == 국[13]:
    print("탄수화물= 5.7g, 단백질= 3.1g, 지질= 0.8g")
if food1 == 국[14]:
    print("탄수화물= 0.6g, 단백질= 0.7g, 지질= 0.05g")




    
if food1 == 면[0]:
    print("탄수화물=22g , 단백질=3.8g, 지질=3.4g")
if food1 == 면[1]:
    print("탄수화물=9.1g , 단백질=2.6g, 지질=0.7g")



if food1 == 반찬[0]:
    print("탄수화물= 24.9g, 단백질= 8.9g, 지질= 0.7g")
if food1 == 반찬[1]:
    print("탄수화물= 5.4g, 단백질= 7.6g, 지질= 6.9g")
if food1 == 반찬[2]:
    print("탄수화물= 4.4g, 단백질= 1.4g, 지질= 0.2g")
if food1 == 반찬[3]:
    print("탄수화물= 5g, 단백질= 2g, 지질= 0.3g")
if food1 == 반찬[4]:
    print("탄수화물= 7.2g, 단백질= 12.1g, 지질= 10.75g")
if food1 == 반찬[5]:
    print("탄수화물= 7.54g, 단백질= 1.43g, 지질= 0.19g")
if food1 == 반찬[6]:
    print("탄수화물= 3.8g, 단백질= 3.4g, 지질= 0.1g")
if food1 == 반찬[7]:
    print("탄수화물= 41.5g, 단백질= 18.5g, 지질= 4g")
if food1 == 반찬[8]:
    print("탄수화물= 3.5g, 단백질= 23g, 지질= 15.7g")
if food1 == 반찬[9]:
    print("탄수화물= 4.2g, 단백질= 1g, 지질=3.5 g")
if food1 == 반찬[10]:
    print("탄수화물= 9g, 단백질= 1.8g, 지질= 3.9g")
if food1 == 반찬[11]:
    print("탄수화물= 39g, 단백질= 6g, 지질= 4.2g")
if food1 == 반찬[12]:
    print("탄수화물= 4.99g, 단백질= 2.4g, 지질= 0.29g")
if food1 == 반찬[13]:
    print("탄수화물= 7.1g, 단백질= 1.94g, 지질= 2.71g")
if food1 == 반찬[14]:
    print("탄수화물= 13.3g, 단백질=11.6g, 지질=8.6g")
if food1 == 반찬[15]:
    print("탄수화물= 54.1g, 단백질=1.8g, 지질=1.2g")
if food1 == 반찬[16]:
    print("탄수화물=2.3g, 단백질=19.65g, 지질=25.46g")
if food1 == 반찬[17]:
    print("탄수화물=28.5g, 단백질=3.3g, 지질=1g")
if food1 == 반찬[18]:
    print("탄수화물=25.07g, 단백질=0.38g, 지질=0.12g")
if food1 == 반찬[19]:
    print("탄수화물= 4.3g, 단백질=3.12g, 지질=1.5g")
if food1 == 반찬[20]:
    print("탄수화물= 11.23g, 단백질=0.33g, 지질=0.11g")
if food1 == 반찬[21]:
    print("탄수화물=32g, 단백질=9g, 지질=10g")
if food1 == 반찬[22]:
    print("탄수화물=3.71g, 단백질=2.77g, 지질=1.49g")
if food1 == 반찬[23]:
    print("탄수화물=8.7g, 단백질=28.1g, 지질=14.54g")
if food1 == 반찬[24]:
    print("탄수화물=6.32g, 단백질=3.08g, 지질=0.2g")
if food1 == 반찬[25]:
    print("탄수화물= 28.44g, 단백질=25.52g, 지질=23.84g")
if food1 == 반찬[26]:
    print("탄수화물=26.5g, 단백질=4.5g, 지질=4g")
if food1 == 반찬[27]:
    print("탄수화물=20.07g, 단백질=20.18g, 지질=15.45g")
if food1 == 반찬[28]:
    print("탄수화물=0.3g, 단백질=23g, 지질=7.7g")
if food1 == 반찬[29]:
    print("탄수화물=3.73g, 단백질=2.26g, 지질=3.32g")
if food1 == 반찬[30]:
    print("탄수화물=13.3g, 단백질=11.6g, 지질=8.6g")
if food1 == 반찬[31]:
    print("탄수화물=8.5g, 단백질=10g, 지질=7g")
if food1 == 반찬[32]:
    print("탄수화물=3.83g, 단백질=0.77g, 지질=4.76g")
if food1 == 반찬[33]:
    print("탄수화물=5g, 단백질=8g, 지질=5g")
if food1 == 반찬[34]:
    print("탄수화물=12.65g, 단백질=3.38g, 지질=4.22g")
if food1 == 반찬[35]:
    print("탄수화물=0.66g, 단백질=37.4g, 지질=5.02g")
if food1 == 반찬[36]:
    print("탄수화물=13.5g, 단백질=9g, 지질=4.5g")
if food1 == 반찬[37]:
    print("탄수화물=44.5g, 단백질=27.5g, 지질=17.5g")
if food1 == 반찬[38]:
    print("탄수화물= 5.01g, 단백질= 1.95g, 지질= 0.39g")
if food1 == 반찬[39]:
    print("탄수화물=7.9g, 단백질=13.97g, 지질=0.77g")
if food1 == 반찬[40]:
    print("탄수화물=24.79g, 단백질=2.80g, 지질=2.01g")
if food1 == 반찬[41]:
    print("탄수화물=13.62g, 단백질=39.44‬g, 지질7.08=g")
if food1 == 반찬[42]:
    print("탄수화물=7.27g, 단백질=1.38g, 지질=7.94g")
if food1 == 반찬[43]:
    print("탄수화물=17.01g, 단백질=18.05g, 지질=10.94g")
if food1 == 반찬[44]:
    print("탄수화물=6.25g, 단백질=3.5g, 지질=5.92g")
if food1 == 반찬[45]:
    print("탄수화물=17.875‬g, 단백질=18.85g, 지질=3.71g")





if food5 == 후식[0]:
    print("탄수화물= 38g, 단백질= 6g, 지질= 21g")
if food5 == 후식[1]:
    print("탄수화물= 25.5g, 단백질= 1.5g, 지질= 0g")
if food5 == 후식[2]:
    print("탄수화물= 12.92g, 단백질= 0.24g, 지질= 0g")
if food5 == 후식[3]:
    print("탄수화물= 8.3g, 단백질= 0g, 지질= 0g")
if food5 == 후식[4]:
    print("탄수화물= 21.1g, 단백질= 5.3g, 지질= 26.6g")
if food5 == 후식[5]:
    print("탄수화물= 24g, 단백질= 0g, 지질= 1g")
if food5 == 후식[6]:
    print("탄수화물= 20.06g, 단백질= 3.34g, 지질= 5.58g")
if food5 == 후식[7]:
    print("탄수화물= 9.25g, 단백질= 1.25g, 지질= 6.3g")
if food5 == 후식[8]:
    print("탄수화물= 3.17g, 단백질= 23.8g, 지질= 0g")
if food5 == 후식[9]:
    print("탄수화물= 1.05g, 단백질= 0g, 지질= 2.4g")
if food5 == 후식[10]:
    print("탄수화물= 45.8g, 단백질= 8.6g, 지질= 17.4g")
if food5 == 후식[11]:
    print("탄수화물= 55.87g, 단백질= 0.14g, 지질= 0.26g")
if food5 == 후식[12]:
    print("탄수화물= 16.07g, 단백질= 1.93g, 지질= 0.03g")
if food5 == 후식[13]:
    print("탄수화물= 20.04g, 단백질= 1.8g, 지질= 6.6g")
if food5 == 후식[14]:
    print("탄수화물= 10g, 단백질= 0g, 지질= 0.3g")
if food5 == 후식[15]:
    print("탄수화물= 26.1g, 단백질= 0g, 지질= 0g")

